Revit 2027 API
Metal.MetalPatternHeight Property
 The property labeled "Amount" from the "Metal" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MetalPatternHeight { get; }
Public Shared ReadOnly Property MetalPatternHeight As String
	Get
public:
static property String^ MetalPatternHeight {
	String^ get ();
}
static member MetalPatternHeight : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 2".
See Also
Reference
Metal Class
Autodesk.Revit.DB.Visual Namespace